Revit 2027 API
RailAngledJoinOption Enumeration
 The angled joins of the rails.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailAngledJoinOption
Public Enumeration RailAngledJoinOption
public enum class RailAngledJoinOption
type RailAngledJoinOption
Members
Member name | Value | Description
AddVerticalOrHorizontalSegments | 0 |  Add vertical or horizontal segments.
NoConnector | 1 |  No connector.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace